{"body": "Вопрос: Что такое Yandex Compute Cloud?\nОтвет: Yandex Compute Cloud — это сервис для создания виртуальных машин в облаке Yandex Cloud. Он позволяет быстро развернуть вычислительные ресурсы с гибкой конфигурацией процессора, памяти и дисков, а также управлять ими через веб-консоль, CLI или API."}
{"body": "Вопрос: Какие операционные системы поддерживаются?\nОтвет: Yandex Compute Cloud поддерживает различные операционные системы: Ubuntu, CentOS, Debian, Windows Server, а также специализированные образы с предустановленным ПО. Вы можете использовать публичные образы из Marketplace или создать собственные образы."}
{"body": "Вопрос: Как создать виртуальную машину?\nОтвет: Создать ВМ можно через консоль управления, CLI (yc compute instance create) или API. При создании нужно указать зону доступности, платформу, количество vCPU и RAM, загрузочный диск с образом ОС, и сетевые настройки. После создания ВМ автоматически запускается."}
{"body": "Вопрос: Можно ли изменить конфигурацию работающей ВМ?\nОтвет: Да, можно изменить количество vCPU и объем RAM, но для этого нужно остановить виртуальную машину. Изменение размера диска возможно без остановки ВМ, но только в сторону увеличения. Платформу и зону доступности изменить нельзя."}
{"body": "Вопрос: Как подключиться к виртуальной машине?\nОтвет: К Linux ВМ подключаются по SSH, используя ключ, указанный при создании. К Windows ВМ — через RDP с паролем, который можно получить через консоль. Для подключения нужен публичный IP-адрес или VPN/Cloud Interconnect для доступа через внутреннюю сеть."}
{"body": "Вопрос: Что такое прерываемые виртуальные машины?\nОтвет: Прерываемые ВМ — это виртуальные машины со скидкой до 70%, которые могут быть принудительно остановлены в любой момент. Они подходят для задач, устойчивых к сбоям: обработка данных, рендеринг, тестирование. Максимальное время работы — 24 часа."}
{"body": "Вопрос: Как работает тарификация?\nОтвет: Тарификация посекундная за фактическое время работы ВМ. Оплачиваются vCPU, RAM и диски отдельно. Минимальная единица тарификации — 1 минута. Остановленные ВМ не тарифицируются за vCPU и RAM, но диски продолжают тарифицироваться."}
{"body": "Вопрос: Какие типы дисков доступны?\nОтвет: Доступны три типа дисков: сетевые HDD (стандартные, дешевые), сетевые SSD (быстрые, для баз данных), и нереплицируемые SSD (максимальная производительность). Все диски автоматически реплицируются для надежности, кроме нереплицируемых."}
{"body": "Вопрос: Можно ли создать снимок диска?\nОтвет: Да, можно создавать снимки (snapshots) дисков для резервного копирования. Снимки создаются инкрементально и хранятся в Object Storage. Из снимка можно создать новый диск или восстановить данные. Снимки тарифицируются по объему хранения."}
{"body": "Вопрос: Как настроить автоматическое резервное копирование?\nОтвет: Используйте расписания снимков (snapshot schedules). Можно настроить автоматическое создание снимков по расписанию (ежедневно, еженедельно) с указанием времени создания и срока хранения. Это обеспечивает регулярное резервное копирование без ручного вмешательства."}
{"body": "Вопрос: Что такое группы размещения?\nОтвет: Группы размещения позволяют управлять физическим размещением ВМ. Spread-группы размещают ВМ на разных физических серверах для отказоустойчивости. Partition-группы делят ВМ на разделы для изоляции сбоев. Это важно для высокодоступных приложений."}
{"body": "Вопрос: Как масштабировать приложение?\nОтвет: Используйте группы виртуальных машин (Instance Groups) для автоматического масштабирования. Можно настроить автоматическое добавление/удаление ВМ на основе метрик (CPU, RAM, количество запросов). Группы интегрируются с балансировщиками нагрузки."}
{"body": "Вопрос: Какие лимиты и квоты существуют?\nОтвет: По умолчанию ограничено количество vCPU (20), объем RAM (96 ГБ), количество дисков (32) и их суммарный объем (500 ГБ) на облако. Лимиты можно увеличить через техподдержку. Также есть ограничения на количество ВМ в группе размещения и snapshot'ов."}
{"body": "Вопрос: Как обеспечить безопасность ВМ?\nОтвет: Используйте группы безопасности для контроля сетевого трафика, регулярно обновляйте ОС, используйте SSH-ключи вместо паролей, настройте мониторинг и логирование. Для критичных данных используйте шифрование дисков и приватные подсети без доступа в интернет."}
{"body": "Вопрос: Можно ли перенести ВМ между зонами доступности?\nОтвет: Прямой перенос невозможен. Нужно создать снимок диска, затем создать новый диск из снимка в другой зоне, и создать новую ВМ. Для минимизации простоя используйте репликацию данных или создайте образ ВМ и разверните его в новой зоне."}
{"body": "Вопрос: Что делать если ВМ не запускается?\nОтвет: Проверьте логи через серийную консоль в веб-интерфейсе. Убедитесь, что диск не поврежден и образ ОС корректен. Проверьте квоты и лимиты. Если проблема сохраняется, создайте снимок диска, создайте новую ВМ из снимка или обратитесь в техподдержку."}
{"body": "Вопрос: Как мониторить производительность ВМ?\nОтвет: Используйте Yandex Monitoring для отслеживания метрик: CPU, RAM, дисковые операции, сетевой трафик. Можно настроить алерты при превышении порогов. Для детального анализа установите агенты мониторинга (Prometheus, Grafana) на ВМ."}
{"body": "Вопрос: Поддерживается ли GPU?\nОтвет: Да, доступны ВМ с GPU NVIDIA Tesla V100 и A100 для задач машинного обучения, рендеринга и научных вычислений. GPU-платформы имеют специальные конфигурации с оптимизированным соотношением vCPU, RAM и GPU. Тарификация почасовая."}
{"body": "Вопрос: Как работает сеть в Compute Cloud?\nОтвет: Каждая ВМ подключается к виртуальной сети (VPC) и получает внутренний IP-адрес. Можно назначить публичный IP для доступа из интернета. Сети изолированы между собой. Для связи между сетями используйте VPN или Cloud Interconnect."}
{"body": "Вопрос: Можно ли использовать собственные образы?\nОтвет: Да, можно загрузить собственный образ диска в формате QCOW2, VMDK или VHD. Образ должен соответствовать требованиям: установлен cloud-init, настроена сеть через DHCP, включена серийная консоль. После загрузки образ можно использовать для создания ВМ."}
{"body": "Вопрос: Какие платформы виртуальных машин доступны?\nОтвет: Доступны платформы Intel Cascade Lake, Intel Ice Lake, AMD EPYC. Каждая платформа имеет разные соотношения vCPU к физическим ядрам и поддерживает разные конфигурации памяти. Выбор платформы влияет на производительность и стоимость."}
{"body": "Вопрос: Как работают метаданные виртуальной машины?\nОтвет: Метаданные доступны изнутри ВМ через специальный эндпоинт 169.254.169.254. Через метаданные можно получить информацию о ВМ, SSH-ключи, пользовательские данные. Это используется для автоматической конфигурации при запуске."}
{"body": "Вопрос: Что такое серийная консоль?\nОтвет: Серийная консоль позволяет получить доступ к ВМ даже если сеть не работает. Доступна через веб-интерфейс или CLI. Полезна для диагностики проблем с загрузкой, сетью или SSH. Логи загрузки сохраняются автоматически."}
{"body": "Вопрос: Можно ли изменить загрузочный диск?\nОтвет: Нельзя изменить загрузочный диск работающей ВМ. Нужно остановить ВМ, отключить старый диск, подключить новый и указать его как загрузочный. Или создать новую ВМ с нужным диском и перенести данные."}
{"body": "Вопрос: Как работает DHCP в облачной сети?\nОтвет: DHCP настроен автоматически для всех подсетей. ВМ получают IP-адреса из диапазона подсети. DNS-серверы настраиваются автоматически. Можно использовать статические IP внутри подсети, но рекомендуется DHCP для гибкости."}
{"body": "Вопрос: Что такое группы безопасности?\nОтвет: Группы безопасности — это виртуальный файрвол для контроля входящего и исходящего трафика ВМ. Правила задаются по протоколу, портам и IP-адресам. Можно создавать правила для групп ВМ. По умолчанию весь трафик запрещен."}
{"body": "Вопрос: Как настроить балансировщик нагрузки?\nОтвет: Используйте Network Load Balancer или Application Load Balancer. NLB работает на уровне L4 (TCP/UDP), ALB — на L7 (HTTP/HTTPS). Балансировщик распределяет трафик между ВМ в целевой группе с проверками здоровья."}
{"body": "Вопрос: Поддерживается ли IPv6?\nОтвет: Да, поддерживается IPv6 для виртуальных машин. Можно назначить IPv6-адрес дополнительно к IPv4. IPv6-адреса публичные и доступны из интернета. Настройка производится при создании или изменении сетевого интерфейса."}
{"body": "Вопрос: Как работает NAT-шлюз?\nОтвет: NAT-шлюз обеспечивает доступ в интернет для ВМ без публичных IP-адресов. Создается в подсети и автоматически маршрутизирует исходящий трафик. Входящие подключения из интернета невозможны. Тарифицируется почасово."}
{"body": "Вопрос: Что такое dedicated host?\nОтвет: Dedicated host — это физический сервер, выделенный только вам. Обеспечивает изоляцию на уровне железа, соответствие требованиям лицензирования (Windows, Oracle). Можно размещать несколько ВМ на одном хосте. Тарификация за весь хост."}
{"body": "Вопрос: Как работает миграция ВМ?\nОтвет: Живая миграция происходит автоматически при обслуживании инфраструктуры. ВМ переносится на другой физический сервер без остановки. Возможна кратковременная задержка сети. Для критичных приложений используйте несколько ВМ с балансировкой."}
{"body": "Вопрос: Можно ли подключить несколько сетевых интерфейсов?\nОтвет: Да, к ВМ можно подключить до 8 сетевых интерфейсов в разных подсетях. Каждый интерфейс может иметь свой IP-адрес и группу безопасности. Полезно для маршрутизаторов, файрволов, multi-tier приложений."}
{"body": "Вопрос: Как работает Cloud Backup?\nОтвет: Cloud Backup — это сервис для резервного копирования файлов и папок с ВМ. Поддерживает инкрементальное копирование, шифрование, расписания. Агент устанавливается на ВМ. Восстановление возможно на любую ВМ. Тарификация по объему хранения."}
{"body": "Вопрос: Что такое placement policy?\nОтвет: Placement policy определяет правила размещения ВМ относительно друг друга. Affinity размещает ВМ близко для низкой задержки. Anti-affinity размещает на разных серверах для отказоустойчивости. Используется в группах размещения."}
{"body": "Вопрос: Как настроить мониторинг с алертами?\nОтвет: В Yandex Monitoring создайте дашборды с метриками ВМ. Настройте алерты на пороговые значения CPU, RAM, диска. Уведомления отправляются в Telegram, email или webhook. Можно использовать готовые шаблоны или создать свои."}
{"body": "Вопрос: Поддерживается ли nested virtualization?\nОтвет: Да, поддерживается вложенная виртуализация на платформах Intel. Позволяет запускать гипервизоры внутри ВМ (Docker, KVM, VirtualBox). Требуется специальная конфигурация и платформа с поддержкой. Производительность ниже чем у обычных ВМ."}
{"body": "Вопрос: Как работает автоматическое восстановление?\nОтвет: При сбое физического сервера ВМ автоматически перезапускаются на другом сервере. Время восстановления зависит от размера ВМ. Для минимизации простоя используйте группы ВМ с автоматическим масштабированием и балансировщики."}
{"body": "Вопрос: Можно ли зарезервировать ресурсы?\nОтвет: Да, можно приобрести committed use discounts (CUD) на 1 или 3 года. Скидка до 30% за резервирование vCPU и RAM. Подходит для стабильных нагрузок. Оплата помесячно. Можно комбинировать с прерываемыми ВМ для экономии."}
{"body": "Вопрос: Как работает Cloud DNS?\nОтвет: Cloud DNS управляет DNS-зонами для ваших доменов. Поддерживает A, AAAA, CNAME, MX, TXT записи. Интегрируется с Compute Cloud для автоматического создания записей. Высокая доступность с SLA 99.95%. Тарификация по количеству зон и запросов."}
{"body": "Вопрос: Что такое instance metadata service?\nОтвет: Instance Metadata Service (IMDS) предоставляет информацию о ВМ изнутри. Доступен по адресу 169.254.169.254. Возвращает ID ВМ, имя, зону, сетевые настройки, SSH-ключи, пользовательские метаданные. Используется для автоконфигурации и service discovery."}
{"body": "Вопрос: Как настроить VPN подключение?\nОтвет: Создайте VPN-шлюз в облаке и настройте IPsec туннель до вашей сети. Поддерживаются статические и динамические маршруты. Можно использовать готовые образы VPN-серверов из Marketplace (OpenVPN, WireGuard). Для высокой доступности используйте два шлюза."}
{"body": "Вопрос: Поддерживается ли UEFI?\nОтвет: Да, поддерживается загрузка через UEFI и Legacy BIOS. Выбор режима зависит от образа ОС. Современные образы используют UEFI. Secure Boot не поддерживается. При создании собственного образа убедитесь в совместимости с выбранным режимом загрузки."}
{"body": "Вопрос: Как работает тегирование ресурсов?\nОтвет: Теги (labels) — это пары ключ-значение для организации ресурсов. Можно фильтровать ВМ по тегам, группировать в отчетах, автоматизировать управление. Максимум 64 тега на ресурс. Используйте для разделения по проектам, окружениям, командам."}
{"body": "Вопрос: Что такое Cloud Logging?\nОтвет: Cloud Logging собирает и хранит логи из ВМ и сервисов. Поддерживает структурированные и неструктурированные логи. Можно настроить фильтры, экспорт в Object Storage, интеграцию с мониторингом. Поиск по логам с использованием запросов. Тарификация по объему."}
{"body": "Вопрос: Как обновить ядро Linux на ВМ?\nОтвет: Используйте стандартные инструменты ОС (apt, yum). Для Ubuntu: apt update && apt upgrade. Для CentOS: yum update. После обновления ядра перезагрузите ВМ. Рекомендуется тестировать обновления на dev-окружении перед production."}
{"body": "Вопрос: Поддерживается ли Windows Server?\nОтвет: Да, доступны образы Windows Server 2016, 2019, 2022. Лицензии включены в стоимость или можно использовать свои (BYOL). Подключение через RDP. Поддерживается Active Directory, IIS, SQL Server. Обновления через Windows Update."}
{"body": "Вопрос: Как работает Cloud Interconnect?\nОтвет: Cloud Interconnect обеспечивает выделенное подключение между вашей сетью и Yandex Cloud. Пропускная способность от 50 Мбит/с до 10 Гбит/с. Низкая задержка и высокая надежность. Подходит для гибридных облаков и миграции больших объемов данных."}
{"body": "Вопрос: Можно ли использовать spot instances?\nОтвет: Да, это называется прерываемые ВМ. Скидка до 70% от обычной цены. Могут быть остановлены в любой момент с предупреждением за 30 секунд. Подходят для batch-обработки, CI/CD, рендеринга. Максимальное время работы 24 часа."}
{"body": "Вопрос: Как настроить автоматическое масштабирование?\nОтвет: Создайте Instance Group с политикой автомасштабирования. Укажите минимальное и максимальное количество ВМ, метрики для масштабирования (CPU, RAM, custom). Настройте целевые значения метрик. Группа автоматически добавляет/удаляет ВМ."}
{"body": "Вопрос: Что такое Cloud Functions?\nОтвет: Cloud Functions — это serverless платформа для запуска кода без управления серверами. Поддерживает Python, Node.js, Go, Java. Автоматическое масштабирование, оплата за время выполнения. Интегрируется с Compute Cloud через триггеры и API."}
{"body": "Вопрос: Как работает Container Registry?\nОтвет: Container Registry хранит Docker-образы. Интегрируется с Compute Cloud для развертывания контейнеров. Поддерживает vulnerability scanning, lifecycle policies. Можно использовать с Kubernetes или запускать контейнеры напрямую на ВМ через Docker."}
{"body": "Вопрос: Как работает Managed Service for Kubernetes?\nОтвет: Managed Kubernetes автоматизирует развертывание и управление кластерами. Yandex Cloud управляет control plane, вы управляете worker nodes. Поддерживаются автоскейлинг, мониторинг, интеграция с Container Registry. Обновления Kubernetes выполняются автоматически."}
{"body": "Вопрос: Что такое Cloud Desktop?\nОтвет: Cloud Desktop — это виртуальные рабочие столы в облаке. Пользователи подключаются через браузер или клиент. Поддерживаются Windows и Linux. Централизованное управление, безопасность данных, доступ из любого места. Тарификация за количество рабочих столов."}
{"body": "Вопрос: Как настроить CI/CD pipeline?\nОтвет: Используйте GitLab CI, Jenkins или GitHub Actions с Compute Cloud. Создайте runner на ВМ или используйте прерываемые ВМ для экономии. Интегрируйте с Container Registry для хранения образов. Автоматизируйте деплой через API или Terraform."}
{"body": "Вопрос: Поддерживается ли Terraform?\nОтвет: Да, есть официальный Terraform provider для Yandex Cloud. Поддерживаются все ресурсы Compute Cloud: ВМ, диски, сети, балансировщики. Можно управлять инфраструктурой как кодом. Интеграция с Terraform Cloud и state backends."}
{"body": "Вопрос: Как работает Object Storage?\nОтвет: Object Storage — это S3-совместимое хранилище для файлов и бэкапов. Неограниченная емкость, высокая доступность. Поддерживает версионирование, lifecycle policies, CDN интеграцию. Тарификация по объему хранения и трафику. Можно монтировать как диск через s3fs."}
{"body": "Вопрос: Что такое Cloud Marketplace?\nОтвет: Cloud Marketplace — это каталог готовых решений и образов. Доступны СУБД, веб-серверы, CMS, инструменты разработки. Образы оптимизированы для Yandex Cloud. Некоторые решения платные, другие бесплатные. Быстрое развертывание в один клик."}
{"body": "Вопрос: Как настроить высокую доступность?\nОтвет: Размещайте ВМ в разных зонах доступности (ru-central1-a, b, c). Используйте балансировщик нагрузки для распределения трафика. Настройте автоматическое восстановление и health checks. Реплицируйте данные между зонами. Используйте managed databases для автоматической репликации."}
{"body": "Вопрос: Поддерживается ли ARM архитектура?\nОтвет: Нет, в настоящее время поддерживаются только x86-64 процессоры (Intel, AMD). ARM процессоры не доступны. Для ARM workloads рассмотрите использование эмуляции или других облачных провайдеров с ARM поддержкой."}
{"body": "Вопрос: Как работает Cloud CDN?\nОтвет: Cloud CDN ускоряет доставку контента через сеть серверов по всему миру. Интегрируется с Object Storage и Compute Cloud. Поддерживает кэширование, сжатие, HTTPS. Снижает нагрузку на origin и улучшает время отклика. Тарификация по трафику."}
{"body": "Вопрос: Что такое Cloud SQL?\nОтвет: Cloud SQL — это managed сервис для PostgreSQL и MySQL. Автоматические бэкапы, репликация, мониторинг. Высокая доступность с автоматическим failover. Масштабирование вертикальное и горизонтальное (read replicas). Интеграция с Compute Cloud через приватные сети."}
{"body": "Вопрос: Как настроить disaster recovery?\nОтвет: Создавайте регулярные снимки дисков по расписанию. Реплицируйте критичные данные в другую зону. Используйте Cloud Backup для файлов. Документируйте процедуры восстановления. Тестируйте восстановление регулярно. Для RTO < 1 час используйте warm standby."}
{"body": "Вопрос: Поддерживается ли multi-cloud?\nОтвет: Да, можно интегрировать с другими облаками через VPN или Cloud Interconnect. Используйте Terraform для управления ресурсами в разных облаках. Для гибридных сценариев настройте site-to-site VPN. Рассмотрите использование Kubernetes для портируемости приложений."}
{"body": "Вопрос: Как работает Identity and Access Management?\nОтвет: IAM управляет доступом к ресурсам. Создавайте пользователей, сервисные аккаунты, группы. Назначайте роли на уровне облака, каталога или ресурса. Поддерживается федерация с Active Directory и SAML. Аудит всех действий через Cloud Logging."}
{"body": "Вопрос: Что такое Cloud Billing?\nОтвет: Cloud Billing отслеживает расходы и управляет оплатой. Детализация по ресурсам и проектам. Настройка бюджетов и алертов при превышении. Экспорт данных для анализа. Поддержка разных способов оплаты. Скидки за объем и committed use."}
{"body": "Вопрос: Как оптимизировать затраты?\nОтвет: Используйте прерываемые ВМ для некритичных задач. Останавливайте dev/test окружения вне рабочих часов. Настройте автоскейлинг для динамических нагрузок. Удаляйте неиспользуемые ресурсы. Используйте reserved instances для стабильных нагрузок. Мониторьте расходы через Cloud Billing."}
{"body": "Вопрос: Поддерживается ли compliance?\nОтвет: Да, Yandex Cloud сертифицирован по ISO 27001, PCI DSS, ГОСТ. Соответствие 152-ФЗ о персональных данных. Дата-центры в России. Доступны compliance отчеты. Для регулируемых отраслей (финансы, здравоохранение) есть специальные решения."}
{"body": "Вопрос: Как работает Cloud Audit?\nОтвет: Cloud Audit логирует все действия с ресурсами. Кто, когда, что изменил. Интеграция с SIEM системами. Хранение логов в Object Storage. Поиск и фильтрация событий. Обязательно для compliance и расследования инцидентов. Retention до 1 года."}
{"body": "Вопрос: Что такое Cloud KMS?\nОтвет: Cloud KMS (Key Management Service) управляет криптографическими ключами. Шифрование данных at rest и in transit. Ротация ключей, аудит использования. Интеграция с Object Storage, Compute Cloud, databases. Соответствие стандартам безопасности. HSM для критичных ключей."}
{"body": "Вопрос: Как настроить DDoS защиту?\nОтвет: Yandex Cloud предоставляет базовую DDoS защиту автоматически. Для расширенной защиты используйте Yandex DDoS Protection. Фильтрация трафика на уровне сети. Защита от L3/L4/L7 атак. Always-on мониторинг. Интеграция с Cloud CDN для дополнительной защиты."}
{"body": "Вопрос: Поддерживается ли bare metal?\nОтвет: Нет, Yandex Compute Cloud предоставляет только виртуальные машины. Для требований к bare metal рассмотрите dedicated hosts, которые обеспечивают изоляцию на уровне физического сервера. Или используйте специализированные bare metal провайдеры."}
{"body": "Вопрос: Как работает Cloud Scheduler?\nОтвет: Cloud Scheduler запускает задачи по расписанию. Поддерживает cron выражения. Может вызывать Cloud Functions, отправлять HTTP запросы, публиковать в очереди. Мониторинг выполнения, retry при ошибках. Полезно для бэкапов, отчетов, периодической обработки."}
{"body": "Вопрос: Что такое Cloud Message Queue?\nОтвет: Cloud Message Queue — это managed очередь сообщений (совместима с Amazon SQS). Асинхронная обработка задач, декаплинг сервисов. Поддерживает FIFO и standard очереди. Dead letter queues для обработки ошибок. Интеграция с Cloud Functions и Compute Cloud."}
{"body": "Вопрос: Как настроить blue-green deployment?\nОтвет: Создайте две идентичные среды (blue и green). Разверните новую версию в green. Протестируйте. Переключите трафик с blue на green через балансировщик. При проблемах быстро откатитесь на blue. Используйте Instance Groups для автоматизации."}
{"body": "Вопрос: Поддерживается ли canary deployment?\nОтвет: Да, используйте балансировщик с весами для постепенного переключения трафика. Начните с 5% на новую версию, мониторьте метрики. Постепенно увеличивайте до 100%. При проблемах откатите вес обратно. Автоматизируйте через API или Terraform."}
{"body": "Вопрос: Как работает Cloud Dataproc?\nОтвет: Cloud Dataproc — это managed Hadoop и Spark кластер. Быстрое создание кластера (< 5 минут). Автоскейлинг, интеграция с Object Storage. Поддержка Hive, HBase, Zeppelin. Оплата только за время работы. Можно создавать временные кластеры для задач."}
{"body": "Вопрос: Что такое Cloud DataLens?\nОтвет: Cloud DataLens — это сервис визуализации данных и BI. Подключение к различным источникам (PostgreSQL, ClickHouse, CSV). Создание дашбордов и графиков. Sharing и embedding. Без необходимости установки. Тарификация по количеству пользователей."}
{"body": "Вопрос: Как настроить мультирегиональность?\nОтвет: Yandex Cloud имеет регион ru-central1 с тремя зонами. Для мультирегиональности используйте репликацию данных между зонами. Настройте DNS с geo-routing. Используйте CDN для глобальной доставки контента. Для критичных приложений рассмотрите multi-cloud стратегию."}
{"body": "Вопрос: Поддерживается ли Service Mesh?\nОтвет: Да, можно использовать Istio или Linkerd в Managed Kubernetes. Service mesh обеспечивает управление трафиком, безопасность, observability между микросервисами. Настройка через Kubernetes CRDs. Интеграция с мониторингом и трейсингом."}
{"body": "Вопрос: Как работает Cloud Trace?\nОтвет: Cloud Trace собирает distributed traces из приложений. Анализ производительности, поиск bottlenecks. Интеграция с популярными фреймворками (OpenTelemetry, Jaeger). Визуализация запросов через микросервисы. Корреляция с логами и метриками."}
{"body": "Вопрос: Что такое Cloud Profiler?\nОтвет: Cloud Profiler анализирует производительность приложений. Профилирование CPU, памяти, I/O. Поддержка Go, Java, Python, Node.js. Минимальный overhead. Flame graphs для визуализации. Помогает оптимизировать код и снизить затраты на инфраструктуру."}